fix: fix postgres
